spotify-app-api/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "NewUser"], ["password", "mypassword"], ["created_at", "2019-08-09 01:23:23.741254"], ["updated_at", "2019-08-09 01:23:23.741254"]]