app/controllers/playlists_controller.rb

INSERT INTO "tracks" ("spotify_id", "playlist_id", "name", "artist", "image", "album_name", "created_at", "updated_at", "album_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "playlists" ("playlist_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["playlist_name", "start playlist"], ["created_at", "2019-08-15 12:03:29.412233"], ["updated_at", "2019-08-15 12:03:29.412233"]]
INSERT INTO "playlists" ("playlist_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["playlist_name", "new one"], ["created_at", "2019-08-15 22:00:38.985412"], ["updated_at", "2019-08-15 22:00:38.985412"]]
---
  def create


    @playlist = Playlist.new(playlist_params)


    @seed_track = params[:playlist][:seed_track]
    @containing_album = params[:playlist][:seed_album]

    puts "var seedtrack = #{@seed_track}"
    puts "seedtrack.id is #{@seed_track[:id]}"

    Track.create!({
      spotify_id: @seed_track[:id],
      playlist_id: @playlist[:id],
      name: @seed_track[:name],
      artist: @containing_album[:artist],
      image: @containing_album[:images][0][:url],
      album_name: @containing_album[:name],
      album_id: @containing_album[:id],
      })

    if @playlist.save

DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 1]]
---
  def destroy
    @playlist.destroy

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def set_playlist
      @playlist = Playlist.find(params[:id])