app/controllers/tracks_controller.rb

INSERT INTO "tracks" ("spotify_id", "playlist_id", "name", "artist", "images", "album_name", "created_at", "updated_at", "album_id", "duration", "explicit", "track_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @track = Track.new(track_params)

    if @track.save